1422/1422.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
               "http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<title>sicily 1422 Table Tennis</title>
<meta http-equiv="Content-Type" content="text/html;charset=utf-8"/>
<meta name="title" content="sicily 1422 Table Tennis"/>
<meta name="generator" content="Org-mode"/>
<meta name="generated" content="2013-05-28 Tue"/>
<meta name="author" content="yuanhang zheng"/>
<meta name="description" content=""/>
<meta name="keywords" content=""/>

</head>
<body>

<div id="preamble">

</div>

<div id="content">
<h1 class="title">sicily 1422 Table Tennis</h1>


<div id="table-of-contents">
<h2>Table of Contents</h2>
<div id="text-table-of-contents">
<ul>
<li><a href="#sec-1">1 Why?</a></li>
<li><a href="#sec-2">2 想法</a></li>
<li><a href="#sec-3">3 分析</a></li>
<li><a href="#sec-4">4 代码</a></li>
</ul>
</div>
</div>

<div id="outline-container-1" class="outline-2">
<h2 id="sec-1"><span class="section-number-2">1</span> Why?</h2>
<div class="outline-text-2" id="text-1">

<p>我已经很老了，本来不应该来刷这种题的了，但是由于面试时被严重鄙视，得回来恶补一下，
于是找了这道传说中的水题来做。
</p></div>

</div>

<div id="outline-container-2" class="outline-2">
<h2 id="sec-2"><span class="section-number-2">2</span> 想法</h2>
<div class="outline-text-2" id="text-2">

<p>真不想写这个总结，因为这题我是看人家的代码的，很羞愧。。贴代码的大神直接在注释里
面说这是水题，连解释都不写，我却还在那里纠结。。什么时候才能修得成果，我不想当码
农啊！！好吧，还是把学习到的写下来吧。
</p></div>

</div>

<div id="outline-container-3" class="outline-2">
<h2 id="sec-3"><span class="section-number-2">3</span> 分析</h2>
<div class="outline-text-2" id="text-3">

<p>题目要求计算出来最终掉到哪个口袋以及反弹的次数。如果有动手在纸上模拟一下的话，
会发现，这个模拟过程就是求最大公约数中的更相减损术，以样例m = 6, n = 10为例，
最大公约数为2, 接触到边长为m的边的次数为6 / 2 = 3，接触到边长为n的次数为
10 / 2 = 5，包括最开始以及最后掉到口袋里面。则反弹次数为除去最开始和最后，
为5 + 3 - 2 = 6。
</p>
<p>
那怎么知道最后掉在哪个口袋里面呢？可以想到，对于B，由于和A是在不同的x轴，在
相同的y轴，则接触边长为m的次数肯定为偶数，接触边长为n的次数肯定为奇数。同理，
可以判断C和D。
</p></div>

</div>

<div id="outline-container-4" class="outline-2">
<h2 id="sec-4"><span class="section-number-2">4</span> 代码</h2>
<div class="outline-text-2" id="text-4">




<pre class="src src-C"><span style="color: #A020F0;">#include</span> <span style="color: #4E9A06;">&lt;stdio.h&gt;</span>

<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">gcd</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">m</span>, <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">n</span>)
{
    <span style="color: #A52A2A; font-weight: bold;">return</span> m ? gcd(n % m, m) : n;
}

<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">is_odd</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">a</span>)
{
    <span style="color: #A52A2A; font-weight: bold;">return</span> a &amp; 1;
}

<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #00578E; font-weight: bold;">main</span>(<span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">argc</span>, <span style="color: #2F8B58; font-weight: bold;">char</span> *<span style="color: #0084C8; font-weight: bold;">argv</span>[])
{
    <span style="color: #2F8B58; font-weight: bold;">int</span> <span style="color: #0084C8; font-weight: bold;">m</span>, <span style="color: #0084C8; font-weight: bold;">n</span>, <span style="color: #0084C8; font-weight: bold;">g</span>, <span style="color: #0084C8; font-weight: bold;">nhits</span>, <span style="color: #0084C8; font-weight: bold;">mhits</span>;
    <span style="color: #2F8B58; font-weight: bold;">char</span> <span style="color: #0084C8; font-weight: bold;">pocket</span>;

    <span style="color: #A52A2A; font-weight: bold;">while</span> (scanf(<span style="color: #4E9A06;">"%d %d"</span>, &amp;m, &amp;n) != EOF) {
        g = gcd(m, n);
        nhits = n / g;
        mhits = m / g;
        <span style="color: #A52A2A; font-weight: bold;">if</span> (!is_odd(nhits) &amp;&amp; !is_odd(mhits)) {
            pocket = <span style="color: #4E9A06;">'A'</span>;
        } <span style="color: #A52A2A; font-weight: bold;">else</span> <span style="color: #A52A2A; font-weight: bold;">if</span> (is_odd(nhits) &amp;&amp; !is_odd(mhits)) {
            pocket = <span style="color: #4E9A06;">'B'</span>;
        } <span style="color: #A52A2A; font-weight: bold;">else</span> <span style="color: #A52A2A; font-weight: bold;">if</span> (is_odd(nhits) &amp;&amp; is_odd(mhits)) {
            pocket = <span style="color: #4E9A06;">'C'</span>;
        } <span style="color: #A52A2A; font-weight: bold;">else</span> {
            pocket = <span style="color: #4E9A06;">'D'</span>;
        }
        printf(<span style="color: #4E9A06;">"%c %d\n"</span>, pocket, nhits + mhits - 2);
    }

    <span style="color: #A52A2A; font-weight: bold;">return</span> 0;
}
</pre>



</div>
</div>
</div>

<div id="postamble">
<p class="date">Date: 2013-05-28 Tue</p>
<p class="author">Author: yuanhang zheng</p>
<p class="creator"><a href="http://orgmode.org">Org</a> version 7.9.3d with <a href="http://www.gnu.org/software/emacs/">Emacs</a> version 24</p>
<a href="http://validator.w3.org/check?uri=referer">Validate XHTML 1.0</a>

</div>
</body>
</html>
